#pragma once

#include "cseries/cseries.hpp"
#include "objects/damage.hpp"
#include "objects/damage_owner.hpp"
#include "objects/lights.hpp"
#include "objects/multiplayer_game_objects.hpp"
#include "objects/object_activation_regions.hpp"
#include "objects/object_broadphase.hpp"
#include "objects/object_definitions.hpp"
#include "objects/object_early_movers.hpp"
#include "objects/object_placement.hpp"
#include "objects/object_recycling.hpp"
#include "objects/object_scheduler.hpp"
#include "objects/object_scripting.hpp"
#include "render/render_objects_static_lighting.hpp"

#define OBJECT_GET(TYPE, INDEX) ((TYPE*)object_get_and_verify_type(INDEX, _object_mask_all))

#define UNIT_GET(INDEX) ((struct unit_datum*)object_get_and_verify_type(INDEX, _object_mask_unit))
#define BIPED_GET(INDEX) ((struct biped_datum*)object_get_and_verify_type(INDEX, _object_mask_biped))
#define VEHICLE_GET(INDEX) ((struct vehicle_datum*)object_get_and_verify_type(INDEX, _object_mask_vehicle))
#define GIANT_GET(INDEX) ((struct giant_datum*)object_get_and_verify_type(INDEX, _object_mask_giant))

#define ITEM_GET(INDEX) ((struct item_datum*)object_get_and_verify_type(INDEX, _object_mask_item))
#define WEAPON_GET(INDEX) ((struct weapon_datum*)object_get_and_verify_type(INDEX, _object_mask_weapon))
#define EQUIPMENT_GET(INDEX) ((struct equipment_datum*)object_get_and_verify_type(INDEX, _object_mask_equipment))


	_object_mask_device = 
		FLAG(_object_type_arg_device) | 
		FLAG(_object_type_terminal) | 
		FLAG(_object_type_machine) | 
		FLAG(_object_type_control),
	_object_mask_arg_device = FLAG(_object_type_arg_device),
	_object_mask_terminal = FLAG(_object_type_terminal),
	_object_mask_machine = FLAG(_object_type_machine),
	_object_mask_control = FLAG(_object_type_control),

	_object_mask_mover =
		_object_mask_unit |
		_object_mask_creature,

	_object_mask_editor_placeable_objects = 
		_object_mask_unit | 
		_object_mask_item | 
		_object_mask_arg_device | 
		_object_mask_terminal | 
		_object_mask_scenery | 
		_object_mask_machine | 
		_object_mask_crate | 
		_object_mask_creature,
};
static_assert(0b0010000000000011 == _object_mask_unit);
static_assert(0b0000000000000001 == _object_mask_biped);
static_assert(0b0000000000000010 == _object_mask_vehicle);
static_assert(0b0010000000000000 == _object_mask_giant);
static_assert(0b0000000000001100 == _object_mask_item);
static_assert(0b0000000000000100 == _object_mask_weapon);
static_assert(0b0000000000001000 == _object_mask_equipment);
static_assert(0b0000000001000000 == _object_mask_projectile);
static_assert(0b0000000010000000 == _object_mask_scenery);
static_assert(0b0000010000000000 == _object_mask_sound_scenery);
static_assert(0b0000100000000000 == _object_mask_crate);
static_assert(0b0001000000000000 == _object_mask_creature);
static_assert(0b0100000000000000 == _object_mask_effect_scenery);
static_assert(0b0000001100110000 == _object_mask_device);
static_assert(0b0000000000010000 == _object_mask_arg_device);
static_assert(0b0000000000100000 == _object_mask_terminal);
static_assert(0b0000000100000000 == _object_mask_machine);
static_assert(0b0000001000000000 == _object_mask_control);
static_assert(0b0011100110111111 == _object_mask_editor_placeable_objects);

// Same as Halo 3
enum e_object_data_flags
{
	_object_hidden_bit = 0,
	_object_always_active_bit,
	_object_being_created_bit,
	_object_wholly_under_media_bit,
	_object_has_attached_lights_bit,
	_object_has_attached_looping_sounds_bit,
	_object_has_unattached_lights_bit,
	_object_in_limbo_bit,
	_object_connected_to_map_bit,
	_object_uses_collidable_list_bit,
	_object_mirrored_bit,
	_object_render_model_has_instances_bit,
	_object_static_lighting_recompute_bit,
	_object_static_lighting_raycast_sideways_bit,
	_object_render_time_node_matrices_complete_bit,
	_object_clip_plane_bit,
	_object_shadowless_bit,
	_object_deleted_when_deactivated_bit,
	_object_outside_of_map_bit,
	_object_cinematic_lod_bit,
	_object_cinematic_collision_bit,
	_object_cinematic_visibility_bit,
	_object_static_pathfinding_bit,
	_object_dynamic_pathfinding_disabled_bit,
	_object_uses_cinematic_lighting_bit,
	_object_has_override_bit,
	_object_created_with_parent_bit,
	_object_reconnect_to_map_bit,
	_object_ever_referenced_by_hs_bit,
	_object_orientations_frozen_bit,
	_object_render_only_orientations_needed_bit,
	_object_is_prt_and_lightmapped_bit,

	k_object_data_flags_count
};

struct object_header_block_reference
{
	int16 size;
	uns16 offset;
};
static_assert(sizeof(object_header_block_reference) == 0x4);

struct _object_datum
{
	c_flags<e_object_data_flags, uns32, k_object_data_flags_count> flags;

	// override
	int32 collision_damage_definition_index;

	int32 next_object_index;
	int32 first_child_object_index;
	int32 parent_object_index;
	uns8 parent_node_index;
	uns8 inhibited_flags;
	int16 scenario_datum_index;
	int16 map_variant_index;
	s_location location;
	real_point3d bounding_sphere_center;
	real32 bounding_sphere_radius;
	real_point3d attached_bounds_center;
	real32 attached_bounds_radius;
	real_point3d attached_bounds_sphere_center;
	real32 attached_bounds_sphere_radius;
	int32 first_cluster_reference_index;
	real_point3d position;
	real_vector3d forward;
	real_vector3d up;
	real_vector3d transitional_velocity;
	real_vector3d angular_velocity;
	real32 scale;
	c_object_identifier object_identifier;
	int16 name_index;
	int8 bsp_placement_policy;
	uns8 keyframed_object_collision_damage_ticks;
	int32 havok_component_index;
	int32 local_physics_space_object_index;
	int32 last_motion_time;
	uns32 physics_flags;
	uns8 physics_deactivation_count;
	uns8 physically_attached_node;
	uns8 phantom_power_scale;
	uns8 phantom_speed_scale;
	int16 in_water_ticks;
	int8 environment_interpenetration_ticks;
	uns8 brittle_collision_damage_timer;
	int16 scale_intepolation_ticks;
	int8 variant_index;
	uns8 object_ai_flags;
	uns32 melee_damage_unique_identifier;
	s_damage_owner damage_owner;
	int16 structure_bsp_fake_lightprobe_index;
	bool created_at_rest;
	uns8 clusters_touched_on_connection;
	int32 simulation_object_glue_index;
	int16 owner_team_index;
	uns8 simulation_flags;
	int8 child_variant_index;
	int32 simulation_object_interpolation_time;
	real_point3d simulation_object_interpolation_position;
	int32 first_widget_index;
	uns16 destroyed_constraints;
	uns16 loosened_constraints;
	real32 maximum_body_vitality;
	real32 maximum_shield_vitality;
	real32 shield_charge_delay;
	real32 body_vitality;
	real32 shield_vitality;
	real32 current_body_damage;
	real32 current_shield_damage;
	real32 recent_body_damage;
	real32 recent_shield_damage;
	real32 shield_impact_current_body_damage;
	real32 shield_impact_current_shield_damage;
	int16 shield_stun_ticks;
	int16 body_stun_ticks;
	uns32 damage_flags;
	int8 damaged_explosion_timer;
	int8 body_damage_delay_ticks;
	int8 shield_impact_decay_timer;
	uns8 recycling_flags;
	int32 next_recycling_object_index;
	int32 recycling_time;
	int32 parent_recycling_group;
	int32 next_recycling_group_member;
	int32 next_sync_action_participant_index;
	int32 sync_action_name;
	c_animation_id sync_animation_id;
	int32 ai_sync_action_arranger_index;
	uns16 render_flags;
	object_header_block_reference original_node_orientations;
	object_header_block_reference node_orientations;
	object_header_block_reference node_matrices;
	object_header_block_reference region_information;
	object_header_block_reference attachments;
	object_header_block_reference damage_sections;
	object_header_block_reference change_colors;
	object_header_block_reference animation;
	object_header_block_reference multiplayer;
	byte __pad16E[0x2];

	// (bsp_index << 24) | probe_index & 0xFFFFFF
	int32 air_probe_index; // airprobes block

	// (bsp_index << 24) | typed_probe_index & 0xFFFFFF
	union
	{
		// scenery probes block
		int32 scenery_air_probe_index;

		// device machine probes block
		int32 device_machine_air_probe_index;
	};
};
static_assert(sizeof(_object_datum) == 0x174);

struct object_datum
{
	int32 definition_index;
	_object_datum object;
};
static_assert(sizeof(object_datum) == sizeof(int32) + sizeof(_object_datum));

enum e_object_header_flags
{
	_object_header_active_bit = 0,
	_object_header_awake_bit,
	_object_header_requires_motion_bit,
	_object_header_post_update_bit,
	_object_header_being_deleted_bit,
	_object_header_do_not_update_bit,
	_object_header_connected_to_map_bit,
	_object_header_child_bit,

	k_object_header_flags_count
};

struct object_header_datum :
	s_datum_header
{
	c_flags<e_object_header_flags, uns8, k_object_header_flags_count> flags;
	c_enum<e_object_type, uns8, _object_type_biped, k_object_type_count> object_type;
	s_cluster_reference cluster_reference;
	int16 data_size;
	int32 datum_handle;
	object_datum* datum;
};
static_assert(sizeof(object_header_datum) == 0x10);

class c_object_iterator_base
{
public:
	int32 get_index();

protected:
	void object_iterator_begin_internal(uns32 type_flags, uns32 header_flags, uns32 iteration_match_flags, int32 next_absolute_index);
	bool object_iterator_next_internal();
	bool object_iterator_next_with_match_flags_internal();
	object_datum* get_datum_internal();

private:
	struct s_object_iterator
	{
		c_flags<e_object_type, uns32, k_object_type_count> type_flags;
		uns32 header_mask;
		uns32 iteration_match_flags;
		int32 object_index;
		int32 index;
		uns32 signature; // 0x86868686 is initialized
	};
	static_assert(sizeof(s_object_iterator) == 0x18);

	object_datum* m_object;
	s_object_iterator m_iterator;
};
static_assert(sizeof(c_object_iterator_base) == 0x1C);

template<typename t_object_type>
class c_object_iterator :
	public c_object_iterator_base
{
public:
	void begin(uns32 type_flags, uns8 match_flags)
	{
		object_iterator_begin_internal(type_flags, match_flags, 0, NONE);
	}

	bool next()
	{
		return object_iterator_next_internal();
	}

	t_object_type* get_datum()
	{
		return reinterpret_cast<t_object_type*>(get_datum_internal());
	}
};

struct s_model_customization_region_permutation // s_model_customization_region
{
	int32 region_name;
	int32 permutation_name;
};
static_assert(sizeof(s_model_customization_region_permutation) == 0x8);

struct object_placement_data
{
	object_placement_data();

	int32 definition_index;
	c_object_identifier object_identifier;
	int32 model_variant_index;
	int32 scenario_datum_index;
	uns8 bsp_placement_policy;
	byte pad1[0x3];
	uns32 flags;
	real_point3d position;
	real_vector3d forward;
	real_vector3d up;
	real_vector3d translational_velocity;
	real_vector3d angular_velocity;
	real32 scale;
	int32 owner_player_index;
	int32 owner_object_index;
	int32 owner_team_index;
	s_damage_owner damage_owner;
	c_flags<int32, uns32, 5> change_color_override_mask;
	c_static_array<real_rgb_color, 5> change_color_overrides;
	int32 model_customization_override_count;
	c_static_array<s_model_customization_region_permutation, 16> model_customization_overrides;
	int32 disabled_regions;
	uns16 destroyed_constraints;
	uns16 loosened_constraints;
	int16 ai_state_type;
	int16 ai_state_size;
	int16 ai_state_alignment_bits;
	bool location_set;
	byte __data147[0x1];
	s_location location;
	bool multiplayer_cinematic_object;
	int32 parent_object_index;
	c_string_id parent_marker;
	c_string_id child_marker;
	s_scenario_multiplayer_object_properties multiplayer_properties;
};
static_assert(sizeof(object_placement_data) == 0x18C);
static_assert(0x000 == OFFSETOF(object_placement_data, definition_index));
static_assert(0x004 == OFFSETOF(object_placement_data, object_identifier));
static_assert(0x00C == OFFSETOF(object_placement_data, model_variant_index));
static_assert(0x010 == OFFSETOF(object_placement_data, scenario_datum_index));
static_assert(0x014 == OFFSETOF(object_placement_data, bsp_placement_policy));
static_assert(0x015 == OFFSETOF(object_placement_data, pad1));
static_assert(0x018 == OFFSETOF(object_placement_data, flags));
static_assert(0x01C == OFFSETOF(object_placement_data, position));
static_assert(0x028 == OFFSETOF(object_placement_data, forward));
static_assert(0x034 == OFFSETOF(object_placement_data, up));
static_assert(0x040 == OFFSETOF(object_placement_data, translational_velocity));
static_assert(0x04C == OFFSETOF(object_placement_data, angular_velocity));
static_assert(0x058 == OFFSETOF(object_placement_data, scale));
static_assert(0x05C == OFFSETOF(object_placement_data, owner_player_index));
static_assert(0x060 == OFFSETOF(object_placement_data, owner_object_index));
static_assert(0x064 == OFFSETOF(object_placement_data, owner_team_index));
static_assert(0x068 == OFFSETOF(object_placement_data, damage_owner));
static_assert(0x074 == OFFSETOF(object_placement_data, change_color_override_mask));
static_assert(0x078 == OFFSETOF(object_placement_data, change_color_overrides));
static_assert(0x0B4 == OFFSETOF(object_placement_data, model_customization_override_count));
static_assert(0x0B8 == OFFSETOF(object_placement_data, model_customization_overrides));
static_assert(0x138 == OFFSETOF(object_placement_data, disabled_regions));
static_assert(0x13C == OFFSETOF(object_placement_data, destroyed_constraints));
static_assert(0x13E == OFFSETOF(object_placement_data, loosened_constraints));
static_assert(0x140 == OFFSETOF(object_placement_data, ai_state_type));
static_assert(0x142 == OFFSETOF(object_placement_data, ai_state_size));
static_assert(0x144 == OFFSETOF(object_placement_data, ai_state_alignment_bits));
static_assert(0x146 == OFFSETOF(object_placement_data, location_set));
static_assert(0x147 == OFFSETOF(object_placement_data, __data147));
static_assert(0x148 == OFFSETOF(object_placement_data, location));
static_assert(0x14A == OFFSETOF(object_placement_data, multiplayer_cinematic_object));
static_assert(0x14C == OFFSETOF(object_placement_data, parent_object_index));
static_assert(0x150 == OFFSETOF(object_placement_data, parent_marker));
static_assert(0x154 == OFFSETOF(object_placement_data, child_marker));
static_assert(0x158 == OFFSETOF(object_placement_data, multiplayer_properties));

struct object_marker
{
	int16 node_index;
	real_matrix4x3 node_matrix;
	real_matrix4x3 matrix;
	real32 radius;
};
static_assert(sizeof(object_marker) == 0x70);

struct s_object_cluster_payload
{
	c_enum<e_object_type, uns8, _object_type_biped, k_object_type_count> object_type;
	uns8 object_visibility_cull_flags;
	uns8 object_collision_cull_flags;
	real_point3d bounding_sphere_center;
	real32 bounding_sphere_radius;
};
static_assert(sizeof(s_object_cluster_payload) == 0x14);

struct s_object_render_data
{
	int32 cached_render_state_index;
};
static_assert(sizeof(s_object_render_data) == sizeof(int32));

struct s_object_globals
{
	bool connected_to_structure_bsp;
	bool force_garbage_collection;
	bool garbage_collection_unsafe;
	bool garbage_collection_cannot_run;
	int16 active_garbage_object_count;
	int16 active_garbage_player_bodies;
	int32 first_garbage_object_index;
	int32 last_garbage_warn_time;
	int32 last_garbage_fail_time;
	int32 last_loud_noise_time;
	int32 object_identifier_salt;
	int32 object_update_absolute_index;
	render_lighting cinematic_lighting;
	real32 scripted_object_functions[4];
	bool custom_animations_hold_on_last_frame;
	bool custom_animations_prevent_lipsync_head_movement;
	bool warthog_chaingun_light_disabled;
	c_static_array<int32, k_object_type_count> scenario_object_to_object_index_type_start_index;
	c_static_array<int32, 6368> scenario_object_to_object_index;
};
static_assert(sizeof(s_object_globals) == 0x6608);

struct s_object_render_thread_message
{
	int32 object_index;
	int16 message_type;
	int16 message_param;
};
static_assert(sizeof(s_object_render_thread_message) == 0x8);

struct objects_information
{
	int16 object_count;
	int16 free_object_count;
	int16 active_object_count;
	int16 active_garbage_count;
	real32 used_memory;
	real32 contiguous_free_memory;

	// unsure of these names
	int32 collideable_object_actual_count;
	int32 collideable_object_maximum_count;
	int32 noncollideable_object_actual_count;
	int32 noncollideable_object_maximum_count;
};
static_assert(sizeof(objects_information) == 0x20);

enum
{
	k_maximum_object_override_count = 16
};

struct s_object_override
{
	bool valid;
	byte pad[0x3];
	int32 object_index;
	int32 shader_index;
};
static_assert(sizeof(s_object_override) == 0xC);

struct s_object_override_globals
{
	s_object_override overrides[k_maximum_object_override_count];
};
static_assert(sizeof(s_object_override_globals) == sizeof(s_object_override) * k_maximum_object_override_count);

extern s_object_override_globals object_override_globals;

extern bool debug_objects;
extern bool debug_objects_early_movers;
extern bool debug_objects_bounding_spheres;
extern bool debug_objects_render_models;
extern bool debug_objects_collision_models;
extern bool debug_objects_physics_models;
extern bool debug_objects_sound_spheres;
extern bool debug_objects_indices;
extern bool debug_objects_programmer;
extern bool debug_objects_garbage;
extern bool debug_objects_names;
extern bool debug_objects_names_full;
extern bool debug_objects_active_nodes;
extern bool debug_objects_animation_times;
extern bool debug_objects_functions;
extern bool debug_objects_position_velocity;
extern bool debug_objects_origin;
