#pragma once

#include "cseries/cseries.hpp"
#include "tag_files/string_ids.hpp"
#include "tag_files/tag_group_definitions.hpp"

#define INVALID_TAG NONE
#define ACHIEVEMENTS_TAG 'achi'
#define AI_DIALOGUE_GLOBALS_TAG 'adlg'
#define AI_GLOBALS_TAG 'aigl'
#define AI_MISSION_DIALOGUE_TAG 'mdlg'
#define ANTENNA_TAG 'ant!'
#define AREA_SCREEN_EFFECT_TAG 'sefc'
#define ARMOR_SOUNDS_TAG 'arms'
#define BEAM_SYSTEM_TAG 'beam'
#define BINK_TAG 'bink'
#define BIPED_TAG 'bipd'
#define BITMAP_TAG 'bitm'
#define BREAKABLE_SURFACE_TAG 'bsdt'
#define CACHE_FILE_GLOBAL_TAGS_TAG 'cfgt'
#define CACHE_FILE_RESOURCE_GESTALT_TAG 'zone'
#define CACHE_FILE_SOUND_TAG '$#! '
#define CAMERA_FX_SETTINGS_TAG 'cfxs'
#define CAMERA_TRACK_TAG 'trak'
#define CAMO_TAG 'cmoe'
#define CELLULAR_AUTOMATA2D_TAG 'whip'
#define CELLULAR_AUTOMATA_TAG 'devo'
#define CHARACTER_TAG 'char'
#define CHOCOLATE_MOUNTAIN_NEW_TAG 'chmt'
#define CHUD_ANIMATION_DEFINITION_TAG 'chad'
#define CHUD_DEFINITION_TAG 'chdt'
#define CHUD_GLOBALS_DEFINITION_TAG 'chgd'
#define CHUD_WIDGET_PARALLAX_DATA_TAG 'cprl'
#define CINEMATIC_SCENE_TAG 'cisc'
#define CINEMATIC_TAG 'cine'
#define CLOTH_TAG 'clwd'
#define COLLISION_DAMAGE_TAG 'cddf'
#define COLLISION_MODEL_TAG 'coll'
#define COLOR_TABLE_TAG 'colo'
#define CONTRAIL_SYSTEM_TAG 'cntl'
#define CORTANA_EFFECT_DEFINITION_TAG 'crte'
#define CRATE_TAG 'bloc'
#define CREATURE_TAG 'crea'
#define DAMAGE_EFFECT_TAG 'jpt!'
#define DAMAGE_RESPONSE_DEFINITION_TAG 'drdf'

#define SHADER_CORTANA_TAG 'rmct'
#define SHADER_CUSTOM_TAG 'rmcs'
#define SHADER_DECAL_TAG 'rmd '
#define SHADER_FOLIAGE_TAG 'rmfl'
#define SHADER_HALOGRAM_TAG 'rmhg'
#define SHADER_LIGHT_VOLUME_TAG 'rmlv'
#define SHADER_PARTICLE_TAG 'rmp\0'
#define SHADER_SCREEN_TAG 'rmss'
#define SHADER_SKIN_TAG 'rmsk'
#define SHADER_TAG 'rmsh'
#define SHADER_TERRAIN_TAG 'rmtr'
#define SHADER_WATER_TAG 'rmw '
#define SHADER_ZONLY_TAG 'rmzo'
#define SHIELD_IMPACT_TAG 'shit'
#define SKY_ATM_PARAMETERS_TAG 'skya'
#define SOUND_CACHE_FILE_GESTALT_TAG 'ugh!'
#define SOUND_CLASSES_TAG 'sncl'
#define SOUND_DIALOGUE_CONSTANTS_TAG 'spk!'
#define SOUND_EFFECT_COLLECTION_TAG 'sfx+'
#define SOUND_EFFECT_TEMPLATE_TAG '<fx>'
#define SOUND_ENVIRONMENT_TAG 'snde'
#define SOUND_GLOBAL_PROPAGATION_TAG 'sgp!'
#define SOUND_LOOPING_TAG 'lsnd'
#define SOUND_MIX_TAG 'snmx'
#define SOUND_SCENERY_TAG 'ssce'
#define SOUND_TAG 'snd!'
#define SOUND_UI_SOUNDS_TAG 'sus!'
#define SQUAD_TEMPLATE_TAG 'sqtm'
#define STEREO_SYSTEM_TAG 'BooM'
#define STRUCTURE_DESIGN_TAG 'sddt'
#define STRUCTURE_SEAMS_TAG 'stse'
#define STYLE_TAG 'styl'
#define SURVIVAL_MODE_GLOBALS_TAG 'smdt'
#define TAG_TEMPLATE_UNIT_TEST_TAG 'uttt'
#define TEST_TAG_TAG 'ttag'
#define TEXTURE_RENDER_LIST_TAG 'trdf'
#define TEXT_VALUE_PAIR_DEFINITION_TAG 'sily'
#define UNIT_TAG 'unit'
#define USER_INTERFACE_FOURTH_WALL_TIMING_DEFINITION_TAG 'fwtg'
#define USER_INTERFACE_GLOBALS_DEFINITION_TAG 'wgtz'
#define USER_INTERFACE_SHARED_GLOBALS_DEFINITION_TAG 'wigl'
#define USER_INTERFACE_SOUNDS_DEFINITION_TAG 'uise'
#define VEHICLE_COLLECTION_TAG 'vehc'
#define VEHICLE_TAG 'vehi'
#define VERTEX_SHADER_TAG 'vtsh'
#define VFILES_LIST_TAG 'vfsl'
#define VISION_MODE_TAG 'vmdx'
#define WEAPON_TAG 'weap'
#define WIND_TAG 'wind'

extern bool const print_reference_updates;

#define UPDATE_REFERENCE_NAME(_reference) { _reference.get_name(); if (_reference.name) { if (print_reference_updates) c_console::write_line("\t%s: '%s.%s'", #_reference, _reference.name, _reference.get_group_name()); } }
#define UPDATE_ARRAY_REFERENCE_NAMES(_array) { for (int32 i = 0; i < NUMBEROF(_array); i++) { if (print_reference_updates) c_console::write_line("\t%s[%d]: '%s.%s'", #_array, i, _array[i].name, _array[i].get_group_name()); } }
#define UPDATE_BLOCK_REFERENCE_NAMES(_block) { for (int32 i = 0; i < _block.count; i++) { if (print_reference_updates) c_console::write_line("\t%s[%d]:", #_block, i); auto& _element = _block[i]; _element.update_reference_names(); } }
#define UPDATE_STRUCT_REFERENCE_NAMES(_struct) { if (print_reference_updates) c_console::write_line("\t%s: ", #_struct); _struct.update_reference_names(); }
#define UPDATE_STRUCT_POINTER_REFERENCE_NAMES(_struct) { if (print_reference_updates) c_console::write_line("\t%s: ", #_struct); _struct->update_reference_names(); }
#define UPDATE_STATIC_RUNTIME_DATA(_struct) { if (print_reference_updates) c_console::write_line("\t%s: ", #_struct); _struct->update_static_runtime_data(); }

int32 const k_tag_file_name_length = 256;

struct s_tag_block
{
	int32 count;
	union
	{
		void* address;
		uns8* base;
	};
	int32 : 32; // uns8* definition;
};
COMPILE_ASSERT(sizeof(s_tag_block) == 0xC);

struct s_tag_reference
{
	tag group_tag = _tag_none;
	const char* name;
	int32 name_length;
	int32 index = NONE;

	void* get_definition();

	template<typename t_type>
	t_type* cast_to()
	{
		return static_cast<t_type*>(get_definition());
	}

	const char* get_name();
	const char* get_group_name();
};
COMPILE_ASSERT(sizeof(s_tag_reference) == 0x10);

struct s_tag_data
{
	int32 size;
	uns32 internal_flags;
	uns32 file_offset;

	union
	{
		void* address;
		uns8* base;
	};

	int32 : 32; // uns8* definition;
};
COMPILE_ASSERT(sizeof(s_tag_data) == 0x14);

template<typename t_element_type, uns32 ...t_extra>
//using c_typed_tag_block = s_tag_block;
class c_typed_tag_block :
	public s_tag_block
{
public:

	t_element_type* begin()
	{
		return static_cast<t_element_type*>(address);
	}

	const t_element_type* begin() const
	{
		return static_cast<t_element_type*>(address);
	}

	t_element_type* end()
	{
		return static_cast<t_element_type*>(address) + s_tag_block::count;
	}

	const t_element_type* end() const
	{
		return static_cast<const t_element_type*>(address) + s_tag_block::count;
	}

	t_element_type& operator[](int32 index)
	{
		ASSERT(VALID_INDEX(index, s_tag_block::count));

		return static_cast<t_element_type*>(address)[index];
	}

	t_element_type& operator[](int32 index) const
	{
		ASSERT(VALID_INDEX(index, s_tag_block::count));

		return static_cast<t_element_type*>(address)[index];
	}

	void clear()
	{
		csmemset(address, 0, sizeof(t_element_type) * s_tag_block::count);
		s_tag_block::count = 0;
	}
};

template<tag ...k_group_tags>
using c_typed_tag_reference = s_tag_reference;

template<typename t_data_type, uns32 ...t_extra>
//using c_typed_tag_data = s_tag_data;
class c_typed_tag_data :
	public s_tag_data
{
public:
	t_data_type* get()
	{
		return reinterpret_cast<t_data_type*>(base);
	}
};

struct s_cache_file_tag_resource_data;
struct s_tag_resource
{
	union
	{
		uns32 resource_handle;
		s_cache_file_tag_resource_data* resource_data;
	};

	uns32 definition_address;
};
COMPILE_ASSERT(sizeof(s_tag_resource) == 0x8);

template<typename t_resource_type, uns32 ...t_extra>
class c_typed_tag_resource :
	public s_tag_resource
{
public:
	t_resource_type* get()
	{
		return reinterpret_cast<t_resource_type*>(resource_handle);
	}
};
COMPILE_ASSERT(sizeof(c_typed_tag_resource<void>) == sizeof(s_tag_resource));

struct s_cache_file_tag_group
{
	tag group_tag;
	tag parent_group_tags[2];
	c_string_id name;

	bool is_group(tag group_tag_)
	{
		return group_tag_ == group_tag || group_tag_ == parent_group_tags[0] || group_tag_ == parent_group_tags[1];
	}

	bool operator==(tag group_tag_)
	{
		return is_group(group_tag_);
	}

	bool operator!=(tag group_tag_)
	{
		return !is_group(group_tag_);
	}
};
COMPILE_ASSERT(sizeof(s_cache_file_tag_group) == 0x10);

extern void* __cdecl tag_block_get_element_with_size(const s_tag_block* block, int32 index, int32 size);
extern void* __cdecl tag_data_get_pointer(const s_tag_data* data, int32 offset, int32 size);
extern void __cdecl tag_load_missing_tags_report();
extern const char* __cdecl tag_name_strip_path(const char* path);
extern const wchar_t* __cdecl tag_name_strip_path(const wchar_t* path);
extern tag group_name_to_group_tag(const char* group_name);
extern void tag_reference_set(s_tag_reference* reference, tag group_tag, const char* name);
extern void tag_block_set_elements(s_tag_block* block, void* elements);
extern void tag_block_set_element_count(s_tag_block* block, int32 count);

static s_cache_file_tag_group global_tag_groups[] =
{
	{
		.group_tag = ACHIEVEMENTS_TAG,
		.name = STRING_ID(global, achievements)
	},
	{
		.group_tag = AI_DIALOGUE_GLOBALS_TAG,
		.name = STRING_ID(global, ai_dialogue_globals)
	},
	{
